analyze -library WORK -format vhdl {utils.vhd mux.vhd select_block.vhd reg_generic.vhd nwin_calc.vhd in_loc_selblock.vhd equal_check.vhd decoder.vhd connection_mtx.vhd address_generator.vhd addr_encoder.vhd windowing_rf.vhd}

elaborate WINDOWING_RF -architecture MIX -library WORK -parameters "NBIT_DATA = 32, NBIT_ADD = 5, M = 8, N = 8, F = 5"

compile -exact_map

report_timing > windowing_rf_timing.rpt

write -hierarchy -format vhdl -output windowing_rf_syn.vhdl
